class Quotes {
  int quote_no = 0;

  List<String> qoutes = [
    "जैसे इस देह में देही जीवात्मा की कुमार, युवा और वृद्धावस्था होती है वैसे ही उसको अन्य शरीर की प्राप्ति होती है। धीर पुरुष इसमें मोहित नहीं होता है।",
    "जो आत्मा को मारने वाला समझता है और जो इसको मरा समझता है वे दोनों ही नहीं जानते हैं, क्योंकि यह आत्मा न मरता है और न मारा जाता है।",
    "आत्मा किसी काल में भी न जन्मता है और न मरता है और न यह एक बार होकर फिर अभावरूप होने वाला है। आत्मा अजन्मा, नित्य, शाश्वत और पुरातन है, शरीर के नाश होने पर भी इसका नाश नहीं होता।",
    "जैसे मनुष्य जीर्ण वस्त्रों को त्यागकर दूसरे नये वस्त्रों को धारण करता है वैसे ही देही जीवात्मा पुराने शरीरों को त्याग कर दूसरे नए शरीरों को प्राप्त होता है।",
    "आत्मा को शस्त्र काट नहीं सकते और न अग्नि इसे जला सकती है जल इसे गीला नहीं कर सकता और वायु इसे सुखा नहीं सकती।",
    "जन्मने वाले की मृत्यु निश्चित है और मरने वाले का जन्म निश्चित है इसलिए जो अटल है अपरिहार्य है उसके विषय में तुमको शोक नहीं करना चाहिये।",
    "सुखदुख, लाभहानि और जयपराजय को समान करके युद्ध के लिये तैयार हो जाओ इस प्रकार तुमको पाप नहीं होगा।",
    "कर्म करने मात्र में तुम्हारा अधिकार है, फल में कभी नहीं। तुम कर्मफल के हेतु वाले मत होना और अकर्म में भी तुम्हारी आसक्ति न हो।",
    "बुद्धियोग युक्त मनीषी लोग कर्मजन्य फलों को त्यागकर जन्मरूप बन्धन से मुक्त हुये अनामय अर्थात निर्दोष पद को प्राप्त होते हैं।",
    "क्रोध से उत्पन्न होता है मोह और मोह से स्मृति विभ्रम। स्मृति के भ्रमित होने पर बुद्धि का नाश होता है और बुद्धि के नाश होने से वह मनुष्य नष्ट हो जाता है।",
    "संयमरहित अयुक्त पुरुष को आत्म ज्ञान नहीं होता और अयुक्त को भावना और ध्यान की क्षमता नहीं होती। भावना रहित पुरुष को शान्ति नहीं मिलती अशान्त पुरुष को सुख कहाँ ?",
    "जो पुरुष सब कामनाओं को त्यागकर स्पृहारहित, ममभाव रहित और निरहंकार हुआ विचरण करता है, वह शान्ति प्राप्त करता है।",
    "कर्मों के न करने से मनुष्य नैर्ष्कम्य को प्राप्त नहीं होता और न कर्मों के संन्यास से ही वह पूर्णत्व प्राप्त करता है।",
    "तुम अपने नियत कर्तव्य कर्म करो क्योंकि अकर्म से श्रेष्ठ कर्म है। तुम्हाम्हारे अकर्म होने से तुम्हारा शरीर निर्वाह भी नहीं सिद्ध होगा।",
    "सम्पूर्ण कर्म प्रकृति के गुणों द्वारा किये जाते हैं अहंकार से मोहित हुआ पुरुष मैं कर्ता हूँ ऐसा मान लेता है।"
  ];

  void SetQuoteNo() {
    quote_no = quote_no + 1;
    quote_no = quote_no % 15;
  }

  int GetQouteNo() {
    return quote_no;
  }
}